{
    "name": "Annaline Silverglide",
	
	"charID":"annaline", 

	"styles": {
		"styleSheet":"Caster", 
		"accentColour":"seagreen",
		"backgroundColour":"#f2f7f4",
		"lighterBackgroundColour":"white",
		"textColour":"darkslategray",
		"backgroundImage":"fixed 0 25% / cover url(\"../images/waves.jpeg\")"
	},

    "basics": {
        "class": "Sorcerer 1",
        "background": "Charlatan",
        "player": "Lottie",
        "race": "Triton",
        "alignment": "True Neutral",
        "xp": "N/A"
    },

	"miscData": { 
        "profBonus": 2,
        "ac": 13,
        "acHover": "Wears no armour.",
        "init": 3,
        "initHover": "", 
        "speed": "30ft",
        "speedHover": "30ft swimming speed.",
        "passivePerception": 11,
		"spellStat":"cha"
    },

    "abilityScores": {
        "str": 9,
        "dex": 16,
        "con": 12,
        "int": 10,
        "wis": 12,
        "cha": 20
    },

    "saveProfs": ["con", "cha"],
    "skillProfs": ["persuasion", "sleight of hand", "insight", "deception"],
	"skillExpertise":[],
    "otherProfs": {
        "Languages": "Common, Primordial & dialects",
        "Armour": "None",
        "Weapons": "Daggers, Darts, Slings, Quarterstaffs, Light crossbows",
        "Tools": "Disguise kit, Forgery kit"
    },

	"health": {
		"maxHp":7,
		"hitDice": ["1d6"]
	},
	
	"defenses": [ 
		{
			"type":"Resistance",
			"text":"Resistance to cold damage"
		}
	],

    "advantages": [],

	"details": { 
		"Appearance":"Annaline has eggshell blue skin and deep green hair. However she has many other characters she often plays which have different appearances. She is 4'10\".",
		"appearanceUrl": "images/annaline.png",
		"Personality Traits":"Flattery is my preferred trick for getting what I want. When I look pretty and give compliments, I can achieve anything.",
		"Ideals":"Independence. I am a free spirit – no one tells me what to do.",
		"Bonds":"I have an ex lover I seek to one day find again. I swindled her, but it’s all water under the bridge… right?",
		"Flaws":"I can't resist swindling people who are richer or more powerful than me. I can’t help it - they just don’t deserve their money."
	},

    "features": { 
		"Race Features": [
			{
				"title": "Amphibious",
				"desc": "You can breathe air and water.",
				"hover": ""
			},
            {
                "title":"Darkvision",
                "desc":"You have darkvision to 60ft.",
                "hover":"You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
            },
			{
				"title": "Emissary of the Sea",
				"desc": "You can communicate simple ideas to any Beast, Elemental, or Monstrosity that has a swimming speed. It can understand your words, though you have no special ability to understand it in return.",
				"hover": ""
			},
            {
                "title":"Control Air and Water",
                "desc":"You can cast Fog Cloud with this trait. Once you cast a spell with this trait, you can’t cast that spell with it again until you finish a long rest.",
                "hover":"Starting at 3rd level, you can cast Gust of Wind with this trait, and starting at 5th level, you can also cast Wall of Water with it. Charisma is your spellcasting ability for all three spells."
            }
		],
		"Class Features": [
			{
				"title": "Tempestuous Magic",
				"desc": "You can use a bonus action on your turn immediately before or after you cast a spell of 1st level or higher. Doing so allows you to fly up to 10 feet without provoking opportunity attacks.",
				"hover": ""
			}
		],
		"Charlatan Background": [
			{
				"title": "Favourite Scheme",
				"desc": "I put on new identities like clothes. I’ve been every girl, and plenty of others too.",
				"hover": ""
			},
            {
                "title":"False Identity",
                "desc":"You have created a second identity that includes documentation, established acquaintances, and disguises that allow you to assume that persona.\nYou can forge documents including official papers and personal letters, as long as you have seen an example of the kind of document or the handwriting you are trying to copy.",
                "hover":""
            }
		]
	},

	"notes": {
		"Backstory":"Here is your backstory blah blah blah",
		"Cons": {
			"Linedyn Watergrass":"Linedyn Watergrass is the trusted handmaid of [insert some triton nobility/royalty]. Her skin is a shiny, pearly light blue and her hair is a deep cerulean. She often wears fancy dresses because she is *best friends* with [whatever nobility/royalty she serves].",
			"Maria Axelath":"Maria Axelath is three quarters human and one quarter triton, and has black hair, skin with just the slightest blue tinge. She's perfect for going unnoticed.",
			"Lady Athrodyn Danallath":"Lady Athrodyn Danallath is the daughter of an undersea noble. Her skin is aqua and her hair is a deep, greenish ultramarine. She has money, but her father is *terribly* stingy with her allowance :(((. She loves to play card games - she doesn't know much about them but somehow she always gets lucky ;) !!"
		},
		"Notes":"[field]",
		"NPCs":"[field]"
	},

	"actions": [
		{
			"name":"Light Crossbow",
			"type":"weapon",
			"proficiency":true, 
			"damageDice":"1d8",
			"ability":"dex", 
			"damageMod":0,
			"damageType":"piercing",
			"hover":"Range 80ft (normal) / 320ft (disadvantage). Loading, range, 2-handed"
		},
        {
			"name":"Dagger",
			"type":"weapon", 
			"proficiency":true,
			"damageDice":"1d4", 
			"ability":"dex",
			"damageMod":0, 
			"damageType":"piercing",
			"hover":"Range 20ft (normal) / 60ft (disadvantage). Finesse, light, range, thrown"
		},
		{
			"name":"Lightning Lure ©",
			"type":"save",
			"saveType":"str", 
			"damageDice":"1d8", 
			"damageMod":0, 
			"damageType":"lightning*",
			"hover":"15ft range. On a save failure the creature is pulled up to 10ft towards you and then, if within 5ft of you, takes the damage." 
		},
        {
			"name":"Ray of Frost", 
			"type":"spell", 
			"damageDice":"1d8",
			"damageMod":0,
			"damageType":"cold*",
			"hover":"60ft range. Make a RANGED spell attack. On a hit the creature's speed is also reduced by 10ft until the start of your next turn." 
		},
        {
			"name":"① Witch Bolt ©", 
			"type":"spell",
			"damageDice":"1d12",
			"damageMod":0,
			"damageType":"lightning",
			"hover":"30ft range. Make a RANGED spell attack. On subsequent turns while concentration lasts (max 1 minute), use your action to deal a subsequent 1d12 automatically. The spell ends if you use your action for something other than this."
		}
	],

    "equipment": [ 
        {
            "name": "Light Crossbow",
			"hover":""
        },
        {
            "name": "Crossbow Bolts",
            "amount": 20,
            "consumable": "semi"
        },
        {
            "name": "Dagger",
            "amount": 2,
            "consumable": "semi"
        },
        "Component Pouch",
        "Set of fine clothes",
        "Disguise Kit",
        "Signet Ring",
        "Explorer's Pack:",
        " Backpack",
        " Bedroll",
        " Mess Kit",
        " Tinderbox",
		{
			"name":" Torches",
			"consumable":"yes"
		},
		{
			"name":" Rations (1 day)",
			"consumable":"yes"
		},
        " Waterskin",
        {
			"name":" Rope (ft)",
			"consumable":"yes"
		}
    ],

	"expendables": { 
		"1st level spells":{
			"type":"dot",
			"amount":2,
			"hover":"",
			"replenish":"Long rest" 
		},
		"Fog Cloud Uses":{
			"type":"dot",
			"amount":1,
			"hover":"For my Control Air and Water feature.",
			"replenish":"Long rest"
		}
	},
	"spellList": {
		"alwaysSpells":{ 
			"Cantrips":{
				"Lightning Lure":"Strike at one creature that you can see within 15 feet of you. The target must succeed on a Strength saving throw or be pulled up to 10 feet in a straight line toward you and then take 1d8 lightning damage if it is within 5 feet of you.",
				"Gust":"You pick one of the following effects:\n\nOne Medium or smaller creature that you choose must succeed on a Strength saving throw or be pushed up to 5 feet away from you.\n\nYou create a small blast of air capable of moving one small object that is neither held nor carried and that weighs no more than 5 pounds. The object is pushed up to 10 feet away from you. (can't cause damage)\n\nYou create a harmless sensory affect using air",
				"Ray of Frost":"Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn.",
				"Shape Water":"You manipulate a 5ft cube of water you can see (within 30ft) in one of the following ways:\n\ninstantaneously move or otherwise change the flow of the water as you direct, up to 5 feet in any direction. (can't cause damage)\n\nThe water forms simple shapes and animates for an hour\n\nYou change the water's colour or opacity (in the same way throughout) for 1 hour\n\nYou freeze the water for 1 hour, if there are no creatures in it."
			},
			"Level 1":{
				"Fog Cloud":"You create a 20-foot-radius sphere of fog centered on a point within range. The sphere spreads around corners, and its area is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it.",
				"Disguise Self":"You make yourself – including your clothing, armor, weapons, and other belongings on your person – look different (1 hour or action to dismiss). \nCan change height by +-1ft, change appearance of weight. You can’t change your limb arrangement. \nFails to hold up to physical inspection. \n\nTo discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC.",
				"Witch Bolt":"Make a ranged spell attack against a creature within 30ft. On a hit, the target takes 1d12 lightning damage, and on each of your turns for the duration, you can use your action to deal 1d12 lightning damage to the target automatically. \n\nThe spell ends if you use your action to do anything else. The spell also ends if the target is ever outside the spell’s range or if it has total cover from you."
			}
		}
	}
}
