{
    "name": "Myrrndie'tra Pruulxshirvandurggol (Myrna Durgol)",
	
	"charID":"myrna",

	"styles": {
		"styleSheet":"Caster",
		"accentColour":"rgb(187, 67, 20)",
		"backgroundColour":"rgb(235, 216, 196)",
		"lighterBackgroundColour":"rgb(250, 235, 219)",
		"textColour":"rgb(125, 27, 5)",
		"backgroundImage":"linear-gradient(rgba(240, 250, 255, 0.7) 0%, rgba(255,255,255,0.7) 100%), fixed 50% 10% / cover url(\"../images/snow5.jpg\")"
	},

    "basics": {
        "class": "Druid 2",
        "background": "Hermit",
        "player": "Lottie",
        "race": "Dragonborn (Brass)",
        "alignment": "Lawful Neutral",
        "xp": "N/A"
    },

	"miscData": { 
        "profBonus": 2,
        "ac": 14,
        "acHover": "10+CON with no armour, 11+CON with leather armour",
        "init": 0,
        "initHover": "", 
        "speed": "30ft",
        "speedHover": "",
        "passivePerception": 20,
		"spellStat":"wis"
    },

    "abilityScores": {
        "str": 14,
        "dex": 10,
        "con": 16,
        "int": 12,
        "wis": 17,
        "cha": 9
    },

    "saveProfs": ["int", "wis"], 
    "skillProfs": ["medicine", "nature", "perception", "religion"],
	"skillExpertise":[], 
    "otherProfs": {
        "Languages": "Common, Draconic, Druidic, Dwarvish",
        "Armour": "Light Armour, Medium Armour, Shields",
        "Weapons": "Clubs, Daggers, Darts, Javelins, Maces, Quarterstaffs, Scimitars, Sickles, Slings, Spears",
        "Tools": "Herbalism kit"
    },

	"health": {
		"maxHp":19,
		"hitDice": ["2d8"]
	},
	
	"defenses": [ 
		{
			"type":"Resistance",
			"text":"Resistance to fire damage"
		}
	],

    "advantages": [
        {
            "type": "skill",
            "skill": "Perception",
            "hover": "From Eyes of the Eagle (item)",
            "disadvantage": false
        }
    ],

	"details": {
		"Appearance":"A stout dragonborn with red and brown scales. She looks sturdy and rough around the edges.",
		"appearanceUrl": "images/myrna.png",
		"Personality Traits":"I will often forget that social etiquette and expectations apply, abruptly ending conversations or saying things that others may consider to be out of line.",
		"Flaws":"I remember every insult I've received and nurse a silent resentment towards anyone who's ever wronged me. There aren't many, so they're harder to forget.",
		"Bonds":"I can't stand the stifling cities. The wilderness calls to me, even though I know I can't survive it alone.",
		"Ideals":"Everyone should be able to handle themselves. It's not worth the trouble meddling in others' affairs."
	},

    "features": {
		"Draconic Ancestry": [
			{
				"title": "Breath Weapon",
				"desc": "You can use your action to exhale destructive energy. It deals fire damage in a 5’x20’ line. (AOE)",
				"hover": "All creatures in the area must make a dexterity saving throw. The DC of this saving throw is 8 + CON + prof bonus. \nA creature takes 2d6 damage on a failed save, and half as much damage on a successful one. \nThe damage increases to 3d6 at 6th level, 4d6 at 11th, and 5d6 at 16th level. \nAfter using your breath weapon, you cannot use it again until you complete a short or long rest."
			},
			{
				"title": "Draconic Resistance",
				"desc": "You have resistance to fire damage.",
				"hover": "Because of Brass Dragon ancestry"
			}
		],
		"Druid Features": [
			{
				"title": "Ritual Casting",
				"desc": "You can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared.",
				"hover": ""
			},
			{
				"title": "Wild Shape",
				"desc": "",
				"hover": "See notes panel"
			},
            {
                "title":"Druidic",
                "desc":"You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages.",
                "hover":"You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom (Perception) check but can't decipher it without magic."
            },
            {
				"title": "Circle of Stars: Star Map",
				"desc": "You've created a star chart as part of your heavenly studies. It is a Tiny object and can serve as a spellcasting focus for your druid spells.\nWhile holding this map, you get some benefits.",
				"hover": "* You know the Guidance cantrip.\n* You have the Guiding Bolt spell prepared. It counts as a druid spell for you, and it doesn't count against the number of spells you can have prepared.\n* You can cast Guiding Bolt without expending a spell slot. You can do so a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\nIf you lose the map, you can perform a 1-hour ceremony to magically create a replacement. This ceremony can be performed during a short or long rest, and it destroys the previous map."
			},
            {
                "title":"Starry Form",
                "desc":"As a bonus action, you can expend a use of your Wild Shape feature to take on a starry form, rather than transforming into a beast. Your starry forms are: \nARCHER. On activation, and as a BA on subsequent turns while it lasts, you can make a ranged spell attack, Target one creature within 60 feet of you. On a hit, 1d8+WIS radiant damage.\nCHALICE. When you cast a spell (w/ a spell slot) that restores HP to a creature, you or another creature within 30ft can regain 1d8+WIS hp.\nDRAGON. When you make an INT or WIS check or a CON save to retain concentration on a spell, treat a roll of 9 or lower on the d20 as a 10.",
                "hover":"While in your starry form, you retain your game statistics, but your body becomes luminous; your joints glimmer like stars, and glowing lines connect them as on a star chart. This form sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The form lasts for 10 minutes. It ends early if you dismiss it (no action required), are incapacitated, die, or use this feature again."
            }
		],
		"Hermit Background": [
            {
				"title": "Life of Seclusion",
				"desc": "You've spent my life in near seclusion with my mother as my only companion.",
				"hover": "We were both wanderers in spirit and she preferred nature’s company to the people in the cities so we tended towards being alone. The extra time to reflect, meditate, and hone whatever skills we wished to pursue was welcome for both of us."
			},
            {
				"title": "Discovery",
				"desc": "The quiet seclusion of your extended hermitage gave you access to a unique and powerful discovery.",
				"hover": "I realised this truth as it was hidden in the stars. I don’t know how it got there or who put it there, but I’ve found it, and I believe it. The stars don’t lie.\n“Once the weather turns, the descent has begun. The land of the dead, and the land of the living, unless families reunite, shall become one.”"
			}
        ]
	},

	"notes": {
        "People":"[field]",
		"General Notes":"[field]",
        "Wild Shape":"You can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\nYour druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.\nYou can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.\n\nWhile you are transformed, the following rules apply:\n\n* Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.\n\n* When you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form, For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.\n\n* You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as Call Lightning, that you've already cast.\n\n* You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense.\n\n* You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.",

		"Backstory":"My mother was considerably more dragonlike than me. When I was growing up, the two of us tried to travel as much as we could (it was a little less cold then and my mother had some low firey abilities she used to keep us both warm) as neither of us found the dreary repetition of life in the cities (which were too hostile and grim for our tastes anyway) to be to our liking. She never spoke of my other parent (if indeed I had one), and I sensed that this meant I shouldn’t ask.\nDuring all our trips, we spent a lot of time looking at the stars, especially when I was very young as my mother was able to keep me warmer even when we were quite exposed. We spent many nights out in the open, gazing at the stars. I started drawing the constellations, adding my own annotations, diagrams and musings. I could feel the weighty power held by the stars and I just *knew* they held secrets if I just figured out how to unlock them.\nOur trips got shorter and shorter as my mother was grew weaker from the cold. I tried to help by learning a few small fire spells from her but despite my best efforts, they weren’t enough. Eventually, she had to leave. The cold was getting to her too much, and she couldn’t keep herself warm, let alone me. So our last trip was to a nearby city, AAA,  that she hoped I would be safe in. My mother dropped me off there before leaving to try to make her way to the elemental plane of fire or somewhere else warmer. (This was about 3 years ago.)\nThe city she left me in was heavily frequented by a group of druids (The Druidic Association for Moon-Watchers, or the “damw”) who live in its outskirts and worship the moon. These druids earn money and reputation by casting long term plant growth on the city (to promote crop growth etc) in return for a share of the produce. They also cast short term plant growth to produce fuel for themselves, which is how they’re able to live closer to the edges of the city than most. As a result, they are well respected in the city, and food and fuel are cheaper there than in other cities, however the residents of the city choose to carefully limit exports to preserve this. (They believe produce of the city should be used for the betterment of the city, and they’re not going to allow themselves to be exploited by bigger cities). The city is pretty small and has a strong community who generally align with communist ideals.\nI began spending time with the damw, admiring their abilities. Throughout the month, they spend spare spell slots casting plant growth on vines and saplings in their own hothouse, then drying out the resulting wood. On each full moon, they travel a day or so out of the city with all their firewood and build big bonfires to keep warm, spending a night or two wild shaping into wolves (many of them aspire to become lycans) and staring at the moon in general. I would go with them, taking the opportunity to study the stars like I used to and making detailed constellation maps, trying to absorb as much knowledge as I could from them. They readily shared their expertise and I began to pick up some of their habits and spells. They taught me to connect to the moon, stars and other nature, telling me that soon I would be able to forge my own path and develop new abilities separate from theirs. In the few years of time I spent with the damw, I learnt druidic, basic spellcasting and how to wild shape.\nI came to Dad a few months ago when the damw, hoping to expand and build relations with other cities, sent a group of members there asking for work and offering to teach their plant growth techniques and provide their services to the city in exchange for help upgrading AAA’s BoHD. The whole thing fell apart quickly (the nihilists were in power in Dad and they didn’t care enough to help) and the druids that had travelled to Dad dispersed, with most of them returning to AAA. But I stayed, hoping to find more different kinds of druids in Dad and learn a larger variety of skills. Since then I have been trying to stay warm and find work in Dad."
	},

	"actions": [
        {
			"name":"Breath Weapon",
			"type":"save",
			"saveType":"dex",
			"damageDice":"2d6",
			"damageMod":0, 
			"damageType":"Fire",
			"hover":"Note the save DC is 8+CON (not wis)+proficiency.\nDeals fire damage in a 5’x20’ line.\nAll creatures in the area must make a DEX save.\nA creature takes 2d6 fire damage on a failed save, and half as much damage on a successful one. \nThe damage increases to 3d6 at 6th level, 4d6 at 11th, and 5d6 at 16th level. \nAfter using your breath weapon, you cannot use it again until you complete a short or long rest."
		},
		{
			"name":"Scimitar",
			"type":"weapon",
			"proficiency":true, 
			"damageDice":"1d6",
			"ability":"str", 
			"damageMod":0, 
			"damageType":"slashing",
			"hover":"Finesse, light"
		},
        {
			"name":"Sickle",
			"type":"weapon",
			"proficiency":true, 
			"damageDice":"1d4",
			"ability":"str", 
			"damageMod":0, 
			"damageType":"slashing",
			"hover":"Simple, light"
		},
        {
			"name":"Dagger",
			"type":"weapon",
			"proficiency":true, 
			"damageDice":"1d4",
			"ability":"str", 
			"damageMod":0, 
			"damageType":"piercing",
			"hover":"Finesse, light, range, thrown. Range 20ft or 60ft with disadvantage"
		},
		{
			"name":"Fire Bolt",
			"type":"spell", 
			"damageDice":"1d10",
			"damageMod":0, 
			"damageType":"fire",
			"hover":"Ranged spell attack, 1d10 fire damage. Ignites flammable object if not worn or carried. 120ft range." 
		},
        {
			"name":"Produce Flame",
			"type":"spell", 
			"damageDice":"1d8",
			"damageMod":0, 
			"damageType":"fire",
			"hover":"For light (10ft bright, 10ft dim, lasts 10min) or attack (Ranged spell attack, 1d8 fire damage. 30ft range). Can use for light for a bit and then decide to attack." 
		},
        {
			"name":"Poison Spray",
			"type":"save",
			"saveType":"con",
			"damageDice":"1d12",
			"damageMod":0, 
			"damageType":"Poison",
			"hover":"No damage on success. 10ft range."
		},
        {
			"name":"Chaos Bolt",
			"type":"spell", 
			"damageDice":"2d8+1d6",
			"damageMod":0, 
			"damageType":"*",
			"hover":"Ranged spell attack. If d8s are the same, you basically get a free casting of Chaos Bolt on a new target. Range 120ft. For damage type: pick one of the d8s.\n1 - Acid\n2 - Cold\n3 - Fire\n4 - Force\n5 - Lightning\n6 - Poison\n7 - Psychic\n8 - Thunder. \nThe damage type d8 also counts for amount of damage." 
		},
        {
			"name":"Guiding Bolt",
			"type":"spell", 
			"damageDice":"4d6",
			"damageMod":0, 
			"damageType":"radiant*",
			"hover":"Ranged spell attack, 2d6 damage on hit, AND the next attack roll made against the target before the end of your next turn has advantage. Range 120ft."
		},
        { 
			"desc":"Wild Shape",
			"hover":"Lasts for 1/2 druid level hours."
		},
        { 
			"desc":"Dash, Disengage, Dodge, Help, Grapple or Shove",
			"hover":"Dash - gain your speed in extra movement\nDisengage - Stop opportunity attacks caused from your movement\nDodge - attack rolls against you have disadvantage if you see the attacker, and advantage on DEX saves. Until start of your next turn. Ends on incapacitation or speed drops to 0.\nHelp - Give adv on next ability check to someone else OR if they’re attacking a creature within 5ft of you, give them adv on first attack roll (both must be before your next turn)\nGrapple or Shove - Make Athletics check opposing target’s acrobatics or athletics, on success the target is incapacitated, pushed 5ft away, or knocked prone. Target must be within reach and at max 1 size larger than you."
		},
        { 
			"desc":"(R) Opportunity attack",
			"hover":"If an enemy moves out of your reach. Make one melee attack against creature."
		},
        { 
			"desc":"(R) Cast Absorb Elements (if prepared)",
			"hover":"Resistance to damage type until start of next turn. The first time you hit with a melee attack on your next turn, target takes an extra 1d6 damage of triggering type.."
		},
        { 
			"desc":"(BA) Cast Healing Word (if prepared)",
			"hover":"Range 60ft. A creature of your choice that you can see gets 1d4+WIS hp back. No effect on undead or constructs."
		},
        { 
			"desc":"(BA) Two Weapon Fighting",
			"hover":"If you attack with a light melee weapon in one hand, you can use your BA to attack with a different light melee weapon in the other hand (this includes throwing as a possibility). Don’t add ability modifier to damage for 2nd attack."
		},
        { 
			"desc":"(BA) Starry Form",
			"hover":"Expend 1 wild shape to assume a starry form."
		},
        { 
			"desc":"(BA) Archer",
			"hover":"If in the ARCHER starry form:\nRanged spell attack (60ft). Radiant damage 1d8+WIS."
		}
	],

    "equipment": [ 
        "Herbalism Kit",
        "Leather Armour",
        {
            "name":"Star Map",
            "hover":"Acts as druidic focus. See features panel for boons while holding."
        },
        {
            "name": "Moon touched sickle",
			"hover":"In darkness, the unsheathed blade of this sword sheds moonlight, creating bright light in a 15-foot radius and dim light for an additional 15 feet.\nThis item can also act as your druidic focus."
        },
        "Scimitar",
        {
            "name": "Eyes of the Eagle Ⓐ",
            "hover":"These crystal lenses fit over the eyes. While wearing them, you have advantage on Wisdom (Perception) checks that rely on sight. In conditions of clear visibility, you can make out details of even extremely distant creatures and objects as small as 2 feet across."
        },
		{
			"name":"Dagger",
			"consumable":"semi",
            "max":2
		},
        "Explorer's pack:",
		" Tinderbox",
		{
			"name":" Torches",
			"consumable":"yes",
            "hover":"Burns for 1 hour. Bright light 20ft, dim light extra 20ft. If you make a melee attack with a burning torch and hit, it deals 1 fire damage."
		},
        {
			"name":" Rations (days)",
			"consumable":"yes",
            "hover": "You can go without food for a number of days equal to 3 + CON (minimum 1). At the end of each day beyond that limit, you automatically suffer one level of exhaustion.\nA normal day of eating resets the count of days without food to zero."
		},
        {
			"name":" Hempen Rope (ft)",
			"consumable":"yes",
            "hover": "Has 2 hit points and can be burst with a DC 17 Strength check."
		},
        {
			"name":" Water (days)",
			"consumable":"semi",
            "max":1,
            "hover":"1 day of water: 3.8L.\nIf you drink only half that much water in a day you must succeed on a DC 15 CON save or suffer one level of exhaustion at the end of the day.\nIf you drink even less water you automatically suffer one level of exhaustion at the end of the day.\nIf you already have one or more levels of exhaustion, you take two levels in either case."
		},
        " Backpack",
        " Bedroll",
        " Mess Kit",
		"A leatherbound notebook filled with drawings of the stars, notes, and other musings",
        "A set of common, warm clothes",
        "Heavy winter blanket(s)",
        "Plain, dark cloak",
        "Coloured pencils",
        "Small knife",
        "Small sewing kit with needle",
        "Technical drawing tools:",
        " Compass",
        " Fine pens",
        " Ruler",
        {
            "name":"Mammoth wool",
            "consumable":"no",
            "amount":"5kg"
        }
        
    ],

	"expendables": { 
		"1st level spells":{
			"type":"dot", 
			"amount":3, 
			"hover":"",
			"replenish":"Long rest" 
		},
        "Chaos Bolt":{
			"type":"dot", 
			"amount":1, 
			"hover":"Can also use a regular spell slot",
			"replenish":"Long rest" 
		},
        "Guiding Bolt":{
			"type":"dot", 
			"amount":2, 
			"hover":"Can also use regular spell slot",
			"replenish":"Long rest" 
		},
        "Wild Shape":{
			"type":"dot", 
			"amount":2, 
			"hover":"",
			"replenish":"Short or Long rest" 
		},
        "Breath Weapon":{
			"type":"dot", 
			"amount":1, 
			"hover":"",
			"replenish":"Short or Long rest" 
		}
	},

	"spellList": { 
		
		"preparable":4, 

		"alwaysSpells":{
            "Cantrips":{
                "Fire Bolt":"Ranged spell attack, 1d10 fire damage. Ignites flammable object if not worn or carried. 120ft range.",
                "Produce Flame":"For light (10ft bright, 10ft dim, lasts 10min) or attack (Ranged spell attack, 1d8 fire damage. 30ft range)",
                "Resistance":"Range: Touch. Duration: up to 1 minute (C). One willing target gets a d4 added to a saving throw of their choice (added before or after roll) made within the duration.",
                "Poison Spray":"CON save. 1d12 damage (none on success). Range 10ft.",
                "Guidance":"Must be holding star map. Range: Touch. Duration: up to 1 minute (C). One willing target gets a d4 added to an ability check of their choice (added before or after roll) made within the duration."
            },
			"Level 1":{ 
				"Chaos Bolt":"Ranged spell attack, 2d8+1d6 damage (for type see actions/spell card). If d8s are the same, you basically get a free casting of Chaos Bolt on a new target. Range 120ft.",
				"Guiding Bolt":"Ranged spell attack, 2d6 damage on hit, AND the next attack roll made against the target before the end of your next turn has advantage. Range 120ft."
			}
		},

		"preparableSpells":{
			"Level 1": { 
				"Absorb Elements":"REACTION. When you take acid, cold, fire, lightning or thunder damage:\nResistance to damage type until start of next turn. The first time you hit with a melee attack on your next turn, target takes an extra 1d6 damage of triggering type.",
				"Animal Friendship":"Range 30ft. Duration 24h. On a beast you can see that can see and hear you, and has intelligence < 4. WIS save or be charmed by you. (If you or a companion harms target, spell ends.)",
                "Beast Bond ©":"Range Touch. Duration 10min. You establish a telepathic link with one beast you touch that is friendly to you or charmed by you that has an intelligence < 4. The link is active while you and beast see each other. It can understand your messages and communicate emotions and concepts. Beast gets adv on attack rolls against creature within 5ft of you that you can see",
                "Charm Person":"Range 30ft. Duration 1hr. WIS save (with adv if you or companions fighting it) or be charmed by you (they regard you as friendly acquaintance) until spell ends or you or companions harms it. Upon spell end, they know they were charmed.",
                "Create or Destroy Water":"Range 30ft. Create up to 38L water in an open container or as rain in 30ft cube (extinguishes flames). OR Destroy up to 38L water in open container or fog in a 30ft cube",
                "Cure Wounds":"Range Touch. Creature regains 1d8+WIS hp. No effect on undead or constructs.",
                "Detect Magic © ®":"Duration 10min. You can sense magic within 30ft of you and use your action to see a faint aura around any visible creature or object that bears magic, and see its school. The spell is blocked by 1ft stone, 1” of metal, a thin sheet of lead, or 3ft of wood or dirt.",
                "Detect Poison & Disease ©":"Duration 10min. You can sense the presence and location of poisons, poisonous creatures and diseases within 30ft of you. You can also identify the kind of each. The spell is blocked by 1ft stone, 1” of metal, a thin sheet of lead, or 3ft of wood or dirt.",
                "Earth Tremor":"You cause a tremor in the ground in a 10ft radius centred on yourself. All creatures other than you: DEX save or 1d6 bludgeoning damage & knocked prone. If the ground is loose earth or stone, it becomes difficult terrain until cleared",
                "Entangle ©":"90ft range. Duration 1min. Grasping weeds and vines sprout from a 20ft square, making the area difficult terrain for the duration. Creatures in the area upon casting: STR save or be restrained until the spell ends. A restrained creature can use its action to make STR check against spell save DC and be free upon success. Plants wilt away after duration.",
                "Faerie Fire ©":"Range 60ft. Duration 1min. Every object in a 20ft cube within range is outlined in coloured light. A creature in the area when the spell is cast must DEX save or be outlined as well. Being outlined means shedding 10ft of dim light. Attack rolls against an affected creature/object have advantage if visible, and the creature/object can’t benefit from being invisible.",
                "Fog Cloud ©":"Range 120ft. Duration 1h. Create a 20ft radius sphere (centre within range) of fog. Spreads around corners and its area is heavily obscured. Lasts for the duration or until dispersed by wind >10pmh.",
                "Goodberry":"Up to 10 berries appear in your hand and are infused with magic. A creature can use its action to eat 1 berry, which restores 1 hp and provides enough nourishment for 1 day. The berries lose their potency if they haven’t been consumed after 24 hours.",
                "Healing Word":"BONUS ACTION. Range 60ft. A creature of your choice that you can see gets 1d4+WIS hp back. No effect on undead or constructs.",
                "Ice Knife":"60ft range. Ranged spell attack, on a hit 1d10 piercing damage. Then (hit or miss) target and each creature within 5ft: DEX save or 2d6 cold damage",
                "Jump":"Range Touch. Duration 1min. Touch a creature, jump distance is tripled until spell ends.",
                "Longstrider":"Range Touch. Duration 1h. The target’s speed increases by 10ft until the spell ends.",
                "Prot. from Evil & Good ©":"Range Touch. Duration 10min. One willing creature you touch is protected against: aberrations, celestials, elementals, fey, fiends, and undead. these creatures have disadvantage on attack rolls against the target. The target also can't be charmed, frightened, or possessed by them. If the target is already charmed, frightened, or possessed by such a creature, they have adv on any saving throws against that effect.",
                "Purify Food and Drink ®":"Range 10ft. All nonmagical food and drink within a 5ft radius sphere centred on a point of your choice is purified and rendered free of poison and disease.",
                "Snare":"CASTING TIME 1 MINUTE. Range Touch. Use cord or rope to create a 5ft radius circle on a flat surface. When you finish casting, it becomes a magical trap. Nearly invisible, requires investigation check against spell save DC to find. Triggers when a Small or larger creature moves into it. \nCreature: DEX save or be restrained and hoisted in the air, hangs upside down 3ft above surface. At the end of each of its turns it can again make a DEX save with disadvantage to break free OR another creature that can reach it can beat your spell save DC with an arcana check.",
                "Speak with Animals ®":"Duration 10min. You can comprehend and verbally communicate with beasts for the duration. Beasts are still limited by their intelligence but can give info about nearby locations and monsters, including whatever they have perceived within the past day. They may be persuaded to perform a small favour for you.",
                "Thunderwave":"Range 15ft cube around self. Each creature within it: CON save or 2d8 thunder damage (halved on success) and pushed 10ft away from you (0 on success). Unsecured objects within the area are automatically pushed 10ft away. Thunderous boom emitted audible to 300ft."
			}
		}
		
	}
}
